In [1]:
import numpy as np
from IPython.display import display
import pandas as pd

In [2]:
df = pd.read_json("students_grades.json", orient="records")
df["math score"] = pd.to_numeric(df["math score"])
df["reading score"] = pd.to_numeric(df["reading score"])
df["writing score"] = pd.to_numeric(df["writing score"])

print(df.columns)
df.head(5)

Index(['names', 'gender', 'race/ethnicity', 'parental level of education',
       'lunch', 'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

,names,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,Rita Courtney,female,group B,some high school,standard,none,37.0,46.0,46.0
1,Madeline Fuller,female,group C,some high school,standard,none,124.0,142.0,142.0
2,Daniel Rester,male,group E,associate's degree,standard,none,156.0,196.0,193.0
3,Charles Linstrom,male,group A,bachelor's degree,standard,completed,80.0,78.0,81.0
4,Geraldine Hale,female,group A,associate's degree,standard,none,131.0,166.0,166.0

In [41]:
inter = np.arange(0, 101, 1)
df_cleaned = df[df["math score"].isin(inter) & df["reading score"].isin(inter) & df["writing score"].isin(inter)]
df_cleaned.drop_duplicates().dropna()

,names,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,Rita Courtney,female,group B,some high school,standard,none,37.0,46.0,46.0
3,Charles Linstrom,male,group A,bachelor's degree,standard,completed,80.0,78.0,81.0
5,Brian Young,male,group C,some high school,standard,none,73.0,66.0,63.0
6,Howard Jimenez,male,group E,some high school,standard,completed,81.0,75.0,76.0
7,Wayne Wilson,male,group B,some high school,standard,completed,94.0,86.0,87.0
...,...,...,...,...,...,...,...,...,...
1392,Richard Young,male,group D,high school,standard,none,69.0,75.0,71.0
1394,Wanda Russell,female,group B,high school,free/reduced,completed,23.0,44.0,36.0
1396,Marina Zeigler,female,group C,bachelor's degree,free/reduced,completed,66.0,74.0,81.0
1397,Laurie Carter,female,group B,some high school,standard,completed,54.0,61.0,62.0
1399,Amanda Perez,female,group A,high school,standard,completed,68.0,80.0,76.0

In [30]:
# Se puede indexar con una boolean series.

# DataFrame con los nombres que están duplicados.
df_test = df[df.duplicated(subset="names", keep=False)]
print("Number of duplicated names: ", len(df_test["names"].unique()))
# Todos deberían ser duplicated.
display(df_test.duplicated(subset="names", keep=False))
# Quitamos los que tengan scores sobre 100.
interval = np.arange(0, 101, 1)
df_test = df_test[df_test["math score"].isin(interval) & df_test["reading score"].isin(interval) & df_test["writing score"].isin(interval)]

# Mostramos el dataframe.
df_test[df_test.duplicated(subset="names", keep=False)]

Number of duplicated names:  246

0       True
5       True
6       True
8       True
10      True
        ...
1385    True
1390    True
1393    True
1395    True
1398    True
Length: 493, dtype: bool

,names,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
66,Anthony Malcomb,male,group C,some college,free/reduced,none,35.0,28.0,27.0
562,Charles Jackson,male,group E,some high school,standard,none,30.0,26.0,22.0
816,Justin Harris,male,group D,some college,standard,none,40.0,42.0,38.0
827,Justin Harris,male,group D,some college,standard,none,40.0,42.0,38.0
900,Anthony Malcomb,male,group C,some college,free/reduced,none,35.0,28.0,27.0
1223,Charles Jackson,male,group E,some high school,standard,none,30.0,26.0,22.0

In [51]:
df.select_dtypes(include=np.number).mean(axis=1)

0        43.000000
1       136.000000
2       181.666667
3        79.666667
4       154.333333
           ...
1395    176.000000
1396     73.666667
1397     59.000000
1398    194.000000
1399     74.666667
Length: 1400, dtype: float64

In [14]:
serie = pd.Series(np.zeros(len(df)), dtype="boolean")
serie[0] = 1
serie.duplicated(keep=False)

0       False
1        True
2        True
3        True
4        True
        ...
1395     True
1396     True
1397     True
1398     True
1399     True
Length: 1400, dtype: bool

In [43]:
df_test = pd.DataFrame({"col1": [1,2,3,4], "col2": [1,2,3,4]})
df_test

   col1  col2
0     1     1
1     2     2
2     3     3
3     4     4

In [45]:
df_test + 1

   col1  col2
0     2     2
1     3     3
2     4     4
3     5     5